Repository: common-repository/shippingo
Catalog: languages/shippingo-*.po
Languages: he_il

source: Bulk cancel Shipments
he_il: ביטול מרוכז

source: Bulk print Labels
he_il: הדפסה מרוכזת

source: Bulk Shipments
he_il: שליחה מרוכזת

source: Cancel
he_il: ביטול

source: Cancel Shipment
he_il: ביטול שטר מטען

source: Check Shipment Status
he_il: בדיקת סטטוס משלוח

source: Edit Shipment
he_il: עריכת שטר מטען

source: Error: All fields must be filled!
he_il: שגיאה: שדות חובה חייבים להכיל ערך!

source: Loading settings
he_il: טוען הגדרות

source: Please contact plugin support
he_il: יש לפנות לתמיכה של הפלאגין

source: Print Label
he_il: הדפסת שטר מטען

source: Print Shipment
he_il: הדפסת שטר מטען

source: Send Shipment
he_il: יצירת שטר מטען

source: Settings
he_il: הגדרות

source: Status Shipment
he_il: סטטוס משלוח

source: Submit
he_il: שליחה

source: Successfully saved!
he_il: נשמר בהצלחה!

source: Your tracking number:
he_il: מספר שטר המטען שלך:
